## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                            |
|----------|------------------------------------------------------------|
| recreate | `aws_eks_node_group.notification-canada-ca-eks-node-group` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-node-group must be replaced
-/+ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ca-central-1:239043911459:nodegroup/notification-canada-ca-staging-eks-cluster/notification-canada-ca-staging-eks-primary-node-group/b0c4dbeb-5bfb-ce33-e851-2d781896e267" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "r5a.large",
          + "r5.large",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-notification-canada-ca-staging-eks-primary-node-group-b0c4dbeb-5bfb-ce33-e851-2d781896e267"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "DEGRADED" -> (known after apply)
        tags                   = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
      ~ version                = "1.26" -> (known after apply)
        # (6 unchanged attributes hidden)


      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
